Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: མཚན་ཉིད་མེད་པ་ནས་མཚན་མ་མེད་པའི་བར་དུ་ནང་གི་ཆུའི་ཁམས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཕྱི་རོལ་གྱི་ཆུའི་ཁམས་ཆེ་བའམ། ཕྲ་བའམ། དམའ་བའམ། བདེ་བའམ།
en: Progressing from their lack of characteristics to their lack of marks, they correctly see the external water elements, whether they be big, small, inferior, blissful, far, or near, as having the quality of perishing just like the internal water elements.

source: གང་རིང་བའམ། གང་ཉེ་བ་དེ་དག་ཐམས་ཅད་ཟད་པའི་ཆོས་སུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །གང་ཟད་པའི་ཆོས་དེའང་མི་རྟག་པའོ། །དེའང་རྟོག་པ་མེད་པའོ། །
en: Whatever has the quality of perishing is impermanent, and it is also not conceptual.

source: གང་རྟོག་པ་མེད་པ་དེའང་སྡུག་བསྔལ་བའོ། །
en: Whatever is not conceptual is also suffering.

source: གང་འབྱུང་བ་མེད་པ་དེའང་བདག་མེད་པའོ། །
en: Whatever does not arise lacks a self.

source: གང་འདུ་བྱེད་ཐམས་ཅད་ཀྱི་ཚིག་གི་ལམ་དང་བྲལ་བ་དེའང་སྟོང་པ་སྟེ།
en: Whatever is compounded is free from all language and empty.

source: ཇི་ལྟར་ནང་དང་ཕྱི་རོལ་གྱི་ཆུའི་ཁམས་ཇི་ལྟ་བ་བཞིན་དུ་སྟོང་པར་ཤེས་པ་དེ་ལྟར་རབ་འབྲིང་དང་ཐ་མའི་ཉོན་མོངས་པ་ཞི་བར་འགྱུར་རོ། །
en: Since they correctly understand that the external and internal water elements are empty, they pacify the severe, middling, and minor afflictions.

source: ནམ་མཁའ་ཇི་ལྟར་གནས་མེད་ཅིང་སྤྲོས་པ་མེད་པ་དེ་བཞིན་དུ་ཕྱི་དང་ནང་གི་ཆུའི་ཁམས་ཀྱང་སྤྲོས་པ་མེད་ཅིང་གནས་མེད་པ་དང་། མི་རྟག་པ་དང་།
en: The inner and outer water elements lack abiding and lack elaboration in the same way that space lacks abiding and lacks elaboration.

source: སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པའི་མཚན་ཉིད་དང་ལྡན་པའི་བཟོད་པ་སྒོམ་པར་བྱེད་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་ཉེ་བར་འཚོ་བ་སྟེ།
en: This cultivation of the acceptance that they have the characteristic of being impermanent, suffering, empty, and without a self is the bodhisattvas’ nurturing and ripening of beings.

source: སའི་ཁམས་དང་། ཆུའི་ཁམས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་མེའི་ཁམས་དང་། རླུང་གི་ཁམས་རྒྱ་ཆེན་པོས་བྱའོ། །
en: The elaborate discussions presented here in the contexts of the earth and water elements should also be applied to the contexts of the fire and air elements.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གཟུགས་ནི་ཐེ་ཙོམ་ཅན་གྱི་རྒྱུ་ལྟ་བུ་སྟེ། །ནང་གིའམ། ཕྱི་རོལ་གྱིའམ། ཆེ་བའམ། ཕྲ་བའམ། དམའ་བའམ།
en: “Furthermore, noble son, the fact that forms are based on the four elements means there is reason to doubt them too.

source: བདེ་བའམ། གང་རིང་བའམ། གང་ཉེ་བ་དེ་དག་ཐམས་ཅད་དངོས་པོ་མེད་ཅིང་གཟུགས་བརྙན་ལྟ་བུ་དང་། དྲུག་གི་སྐྱེ་མཆེད་དབང་དུ་གྱུར་པ། སའི་ཁམས་ནས་རྣམ་པར་ཤེས་པའི་རྒྱུའི་བར་དུའོ། །
en: Whether they are internal, external, big, small, inferior, blissful, far, or near, they are all insubstantial, they are all like reflections, and they are all subject to the power of the six sense fields, from the earth element up to the cause of consciousness.

source: གང་སྐད་ཅིག་སྐད་ཅིག་ཏུ་འབྱུང་བ་ཟད་པའི་ཆོས་ཉིད་དབང་པོ་དེ་ལ་ཟད་པ་དང་། འགོག་པ་དེ་ནི་འབྱུང་བ་ཟད་པ་ཉིད་དུ་བརྟག་གོ། །དངོས་པོ་མེད་པ་དང་། བདག་མེད་པར་དམིགས་པ། ཚིག་གི་ལམ་མེད་པ་དང་། རྣམ་པར་མི་འགྲོ་བ་དང་། མ་སྐྱེས་པ་དང་། མ་བྱུང་བ་དང་།
en: The sense faculties have the quality of arising and perishing from moment to moment, and bodhisattvas analyze things that perish and cease as having the nature of arising and perishing.

source: བདག་མེད་པ། བདག་གི་མེད་པ་དང་། ཞི་གནས་ཀྱི་མཚན་ཉིད་ཀྱི་ཚུལ་དང་། རྟོག་པ་མེད་ཅིང་སྨོན་པ་མེད་པའི་ཚུལ་དང་། མཚན་མ་མེད་པའི་ཚུལ་དང་། ལྷག་མཐོང་གི་ཚུལ་གྱིས་བརྟག་པར་བྱའོ། །མཚན་ཉིད་མེད་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་།
en: The forms that bodhisattvas observe to be insubstantial and without a self should be analyzed from the perspective of the lack of verbal expression, the lack of going, the lack of arising, the lack of origination, the lack of a self, and the lack of ownership; from the perspective of the characteristic of tranquility; from the perspective of the lack of concept, the lack of purpose, and the lack of signs; and from the perspective of special insight.

source: རྣམ་པ་དང་བྲལ་བ་དང་། བདག་མེད་པ་དང་། ཡིད་ཀྱི་འདུ་བྱེད་དང་བྲལ་བ་དང་། ཡི་གེ་མེད་པ་དང་། རྒྱུ་དང་རྐྱེན་དང་བྲལ་བར་རབ་ཏུ་ཤེས་སོ། །
en: Bodhisattvas understand that they lack characteristics, that they are free from all afflictions, that they are free from aspects, that they lack a self, that they are free from mental formations, that they are devoid of words, and that they are free from causes and conditions.

source: དངོས་པོ་མེད་པ་ཤིན་ཏུ་སྐད་ཅིག་མ་དང་བྲལ་བར་རབ་ཏུ་ཤེས་སོ། །
en: They understand that they are insubstantial and free from momentariness.

source: འདུ་བྱེད་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། ཡུན་རྒྱུན་ཆད་པ་མེད་པར་རབ་ཏུ་ཤེས་སོ། །
en: They understand that all formations are without marks and without duration and conclusion.

source: འདུ་བྱེད་ཐམས་ཅད་གནས་མེད་ཅིང་ཉེ་བར་ཞི་བར་རབ་ཏུ་ཤེས་སོ། །
en: They understand that all formations are groundless and utterly pacified.

source: རྣམ་པ་འདི་དག་གིས་གཟུགས་དངོས་པོ་མེད་པ་ལྦུ་བའི་ཕུང་པོ་ལྟར་བརྟག་གོ། །
en: They use these aspects to analyze forms as being insubstantial like a mass of foam.

source: མཚན་ཉིད་མེད་པ་ནས་མཚན་མ་མེད་པའི་བར་དུ་དེ་དག་ཐམས་ཅད་ཟད་པའི་ཆོས་སུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: They see that everything is without characteristics up to being without marks, and everything has the quality of being perishable.

source: གང་ཟད་པའི་ཆོས་དེ་མི་རྟག་པའོ། །
en: Whatever has the quality of perishing is impermanent.

source: གང་མི་རྟག་པ་དེ་ནི་རྟོག་པ་མེད་པའོ། །
en: Whatever is impermanent is also not conceptual.

source: གང་རྟོག་པ་མེད་པ་དེ་ཡང་སྡུག་བསྔལ་བའོ། །
en: Whatever is not conceptual is also suffering.

source: གང་འདུ་བྱེད་ཐམས་ཅད་ཀྱི་ལམ་དང་བྲལ་བ་དེ་ཡང་སྟོང་པའོ། །
en: Whatever is compounded is free from all paths and is empty.

source: གང་ནང་དང་ཕྱི་རོལ་གྱི་གཟུགས་དེ་དག་ལྦུ་བའི་ཕུང་པོ་ལྟ་བུ་དངོས་པོ་མེད་ཅིང་གཟུགས་བརྙན་ལྟ་བུར་སྟོང་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དེ་ལྟར་རབ་འབྲིང་དང་ཐ་མའི་ཉོན་མོངས་པ་ཉེ་བར་ཞི་བར་འགྱུར་རོ། །
en: Since they correctly understand that those inner and outer forms are insubstantial like water foam and empty like reflections, their severe, middling, and minor afflictions will be pacified.

source: ནམ་མཁའ་ཇི་ལྟར་དམིགས་པ་མེད་ཅིང་འདུས་བྱས་པ་མེད་པ་དེ་བཞིན་དུ་གཟུགས་ཀྱང་ལྦུ་བ་ལྟ་བུར་འདུ་ཤེས་པ་མེད་ཅིང་འགྱུར་བ་མེད་པ་དང་།
en: Just as space is not apprehended and is unconditioned, forms that are like water foam are also not perceived and are unchanging.

source: ཚོར་བ་མེད་པ་དང་། མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་།
en: They lack feelings, they are impermanent, they are suffering, they lack a self, and they are empty.

source: སྟོང་པའི་མཚན་ཉིད་དང་བྲལ་བའི་བཟོད་པ་སྒོམ་པར་བྱེད་པ་འདི་དང་། བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་ཉེ་བར་འཚོ་བའི་བཟོད་པ་བ་ལྟ་བར་བྱའོ། །
en: The cultivation of the acceptance that is free from those characteristics should be regarded as the bodhisattvas’ acceptance that ripens and looks after beings.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གཟུགས་ནི་ཕྱི་རོལ་དང་ནང་གི་ནས་གང་ཉེ་བའི་བར་དུ་རང་བཞིན་གྱིས་གཟུགས་བརྙན་ལྟ་བུའི་རྒྱུ་འདྲ་བ་མངོན་པར་མི་འགྱུར་བ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། ལུས་མངོན་པའི་མཚན་ཉིད་དུ་བརྟག་གོ། །
en: “Furthermore, noble son, they analyze forms—whether they be anywhere from internal to external, up to or those that are near—to have the nature of being unchanging in the same way as the cause of a mirror image, to be like an illusion, and as having the characteristics of a visible body.

source: གཟུགས་ནི་ཅི་ལའང་ཆགས་པ་མེད། སྙེམས་པའང་མེད། བླང་བ་དང་དོར་བ་མེད་པར་ཤེས་ཏེ། གཟུགས་ནི་གཉིས་སུ་མེད་དོ། །
en: They understand forms without any attachment whatsoever, without conceit, without accepting, and without rejecting, so they know that forms are nondual.

source: ཆོས་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་ལ་ཡང་དག་པར་གཞོལ་བར་ཤེས་པས་འབྱུང་བ་ཆེན་པོ་བཞིའི་གཟུགས་ཐམས་ཅད་ཅུང་ཟད་ཀྱང་དབྱེར་མེད་དོ། །ཚིག་གི་ལམ་ཐམས་ཅད་གནས་མེད་པར་ཡང་དག་པར་ཤེས་སོ། །
en: Since they know that all phenomena are included within the realm of phenomena, they understand that all forms made of the four great elements are completely indivisible, and that all language is baseless.

source: གཟུགས་ནི་གཞན་དུ་སོང་བའང་མེད་ཅིང་ཡུལ་མེད་པ་དང་། གློ་བུར་གྱི་སྡུག་བསྔལ་བ་དང་། རྒྱུན་བཅད་པ་དང་རྒྱུན་མ་བཅད་པའི་མདུད་པ་གཉིས་དང་བྲལ་བ་དང་། གཟུགས་བརྙན་ལྟ་བུ་དང་། གནས་མེད་པར་བརྟག་གོ། །
en: They analyze forms as not going anywhere else, as not having a location, as adventitious suffering, as free from the two bonds of continuity and discontinuity, as like reflections, and as groundless.

source: གཟུགས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ནི་ལྦུ་བའི་ཕུང་པོ་ལྟ་བུར་དམིགས་པ་མེད་པ་དང་། ཀུན་འབྱུང་བ་མེད་པ་དང་། ཤིན་ཏུ་རང་བཞིན་མེད་པར་བརྟག་གོ། །
en: They analyze the characteristics of all forms as being like a mass of foam, without apprehension, without origin, and utterly devoid of intrinsic nature.

source: འབྱུང་བ་ཆེན་པོ་བཞི་རྣམས་ནི་རྣམ་པར་དག་པ། རྣམ་པར་མི་རྟོག་པ། མི་འབྱུང་བ། མངོན་པར་མི་སྒྲུབ་པ། ཆོས་ཐམས་ཅད་སྤྲོས་པའི་རྒྱུན་བཅད་པ་ཐམས་ཅད་དུ་ཞུགས་པ་མེད་པར་བརྟག་གོ། །
en: They analyze the four great elements as being completely pure, without concepts, not originating, not fully established, and without engaging in any form of discontinuity related to the proliferation of all manner of qualities.

source: འབྱུང་བ་ཆེན་པོ་བཞིའི་གཟུགས་ཀྱི་ཕུང་པོའི་མཚན་ཉིད་ནི་སྙེམས་པ་མེད་པ་དང་། གཏོང་བ་མེད་པ་དང་། མུན་པ་མེད་པ་དང་། སྣང་བ་མེད་པ་དང་། ཡིད་ལ་མི་བྱེད་པ་དང་། གཉིས་སུ་མེད་པ་དང་། སོགས་པ་མེད་པ་དང་།
en: They analyze the characteristics of the aggregate of forms that are made of the four great elements as being without conceit, without giving, without darkness, without light, without mental engagement, without duality, without accumulation, without elaboration, indivisible, like a reflection, indivisible, and insubstantial.

source: སྤྲོས་པ་མེད་པ་དང་། གཟུགས་བརྙན་ལྟ་བུ་དབྱེར་མེད་པ་དང་། དངོས་པོ་མེད་པར་བརྟག་གོ། །གཟུགས་འབྱུང་བ་ཆེན་པོ་བཞི་ནི་ཤིན་ཏུ་རྣམ་པར་མི་རྟོག་པ་དང་། ཟད་པ་དང་ལྦུ་བ་ལྟ་བུར་བལྟའོ། །
en: They analyze the four great elements that constitute form as being completely nonconceptual, and as perishable like water foam.

source: རྣམ་པ་འདི་དག་གིས་གཟུགས་ལ་དངོས་པོ་མེད་པར་གཟུགས་བརྙན་ལྟ་བུར་རྟོག་གོ། །
en: They use these aspects to analyze forms as being insubstantial like reflections.

source: མཚན་ཉིད་མེད་པ་ནས་མཚན་མ་མེད་པའི་བར་དུ་འདུ་བྱེད་ཐམས་ཅད་ཟད་པའི་ཆོས་སུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: They see that all formations are lacking characteristics up to lacking marks, and that they have the quality of being perishable.

source: གང་མི་རྟག་པ་དེ་རྟོག་པ་མེད་པའོ། །
en: Whatever is impermanent is also not conceptual.

source: གང་རྟོག་པ་མེད་པ་དེ་སྡུག་བསྔལ་བའོ། །
en: Whatever is not conceptual is also suffering.

source: གང་འདུ་བྱེད་ཐམས་ཅད་ཀྱི་ཚིག་གི་ལམ་དང་བྲལ་བ་དེ་ཡང་སྟོང་པ་སྟེ།
en: Whatever is compounded is devoid of all linguistic expression and empty.

source: ཇི་ལྟར་ཕྱི་དང་ནང་གི་གཟུགས་ལྦུ་བ་འདྲ་བ་སྟོང་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དེ་ལྟར་རབ་འབྲིང་དང་ཐ་མའི་ཉོན་མོངས་པའང་ཉེ་བར་ཞི་བར་འགྱུར་རོ། །
en: Since they correctly understand that those inner and outer forms are empty like water foam, their severe, middling, and minor afflictions will be pacified.

source: ནམ་མཁའ་ཇི་ལྟར་ཟད་པ་མེད་ཅིང་གཟུགས་མེད་པ་དང་བསྟན་དུ་མེད་པ་དེ་བཞིན་དུ་ཟད་པ་མེད་ཅིང་མཚན་ཉིད་མེད་པ་དང་། གཟུགས་མེད་པ་དང་། བསྟན་དུ་མེད་པ་དང་། ལྦུ་བ་ལྟ་བུར་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་།
en: Just as space is inexhaustible, formless, and indefinable, forms also have the characteristics of being inexhaustible, formless, undefinable, impermanent like water foam, suffering, devoid of self, and empty.

source: བདག་མེད་པ་དང་། སྟོང་པའི་མཚན་ཉིད་ལ་དམིགས་པའི་མཚན་ཉིད་དང་བྲལ་བའི་བཟོད་པ་སྒོམ་པར་བྱེད་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་ཉེ་བར་འཚོ་བར་བལྟའོ། །
en: The cultivation of the acceptance that is free from those apprehended characteristics should be regarded as the bodhisattvas’ acceptance that ripens and looks after beings.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གཟུགས་འབྱུང་བ་ཆེན་པོ་བཞིའི་མཚན་ཉིད་ནང་གི་ནས་ཉེ་བའི་བར་དུ་གང་སྨྲས་པ་དེའི་གཟུགས་ཀྱི་མཚན་ཉིད་ནི་མིག་ཡོར་ལྟ་བུ་དང་། གྲིབ་མ་ལྟ་བུ་དང་། ལྦུ་བ་ལྟ་བུ་གནས་མེད་པ་དང་། ནམ་མཁའ་ལྟ་བུ་ཆགས་པ་མེད་པ་དང་། བརྗོད་དུ་མེད་པ་དང་།
en: “Furthermore, noble son, they understand that, whether the characteristics of the four elements that constitute form are internal, up to being near, any characteristic of form that one might mention is like an optical illusion, like a shadow, baseless like water foam, devoid of attachment like space, inexpressible, and without accumulation.

source: སོགས་པ་མེད་པ་ནས་ཁམས་གསུམ་གྱི་འཁོར་བ་བདག་མེད་པ་ལྟ་བུ་དང་། དུས་གསུམ་གྱི་མཚན་ཉིད་ཐོབ་པ་དང་། དམིགས་པ་མེད་པ་དང་། ཡི་གེ་མེད་པ་དང་། གཉིས་སུ་མེད་པའི་མཐའ་དང་། རྟག་པའི་མཐའ་དང་། ཀུན་དུ་བཟུང་བའི་མཐའ་དང་། ཟད་པ་མེད་པར་སྤྱོད་པའི་མཐའ་དང་། ཉོན་མོངས་པ་མེད་པའི་མཐའ་དང་། །
en: They understand that the three realms of saṃsāra and the three times have the same characteristic of lacking a self and that they are not apprehended and are wordless, and they understand the position of nonduality, of permanence, of nonapprehension, of inexhaustible conduct, of the absence of afflictions, of the nonexistence of objects, of the absence of movement, and of inexpressibility, and that forms have the characteristic of being like a reflection.

source: ཡུལ་མེད་པའི་མཐའ་དང་། རབ་ཏུ་རྒྱུ་བ་མེད་པའི་མཐའ་དང་། །སྨྲ་བ་མེད་པའི་མཐའ་དང་། གཟུགས་བརྙན་ལྟ་བུར་གཟུགས་དེའི་མཚན་ཉིད་དུ་རབ་ཏུ་ཤེས་སོ། །འདོད་པའི་ཁམས་དང་གཟུགས་ཀྱི་ཁམས་དེ་གཉིས་ཀྱི་གཟུགས་ཀྱི་སྣང་བ་ནམ་མཁའ་ལྟ་བུར་བརྟག་གོ། །
en: They analyze the appearances of forms of both the desire and the form realms as being like space.

source: མིག་ཡོར་གྱི་མཚན་ཉིད་ནམ་མཁའ་ལྟ་བུར་དངོས་པོར་དམིགས་པ་མེད་པ་སྟེ།
en: They have the characteristics of optical illusions, they are like space, and they are not apprehended as existent entities.

source: ནམ་མཁའ་ཇི་ལྟ་བུར་གཟུང་དུ་མེད་ཅིང་ཀུན་ནས་ལྡང་བ་མེད་པ་དང་། དངོས་པོ་མེད་པ་དེ་ལྟར་དེ་བཞིན་དུ་གཟུགས་ཀྱི་མཚན་ཉིད་ཀྱང་མིག་ཡོར་ལྟ་བུ་དང་། ཚུ་རོལ་དང་ཕ་རོལ་བྲལ་བའི་གནས་མེད་པའོ། །
en: Just as space is devoid of apprehension, without arising, and insubstantial, forms also have the characteristic of being like optical illusions and are baseless in the sense of being free from this or that side.

source: གཟུགས་ཀྱི་མཚན་ཉིད་ནི་མཉམ་པའི་མཚན་ཉིད་དང་། །སྒྲ་བརྙན་ལྟ་བུ་དང་།
en: Forms have the characteristic of sameness.

source: ལྦུ་བའི་ཕུང་པོ་ལྟ་བུ་དང་། ཆོས་ཀྱི་དབྱིངས་དང་།
en: They are like echoes, water foam, and the realm of phenomena.

source: ནམ་མཁའི་ཁམས་ཀྱི་གཟུགས་ཀྱི་སྒྲ་བརྙན་ནི་ཁམས་མེད་པ་དང་། ཐ་དད་པ་མེད་པ་དང་། མཚུངས་པ་མེད་པ་དང་། འཁྲུག་པ་མེད་པའོ། །
en: The echoes of forms of the element of space lack the elements, lack difference, lack sameness, and lack disturbance.

source: དེ་ལྟར་དེ་བཞིན་དུ་ཆོས་འདི་དག་ཀྱང་ནམ་མཁའ་ལྟ་བུའོ། །གཟུགས་ཀྱི་སྣང་བ་དེ་ཡང་གཟུང་དུ་མེད་པ་དང་། བསགས་པ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། གཡོ་བ་མེད་པ་དང་། འགྱུར་བ་མེད་པ་དང་། འཆི་འཕོ་བ་མེད་པ་དང་།
en: In that way, these phenomena are similar to space.

source: མི་གནས་པ་དང་། བདག་དང་གཞན་གྱི་ལ་མི་ལེན་པ་དང་། ཡོངས་སུ་མི་རྟོག་པ་དང་། ཆགས་པ་མེད་པ་དང་།
en: “Physical appearances are not apprehended, noncomposite, unborn, unoriginated, unwavering, unchanging, undying, nonabiding, not acquired by oneself or others, utterly nonconceptual, without attachment, and unfabricated.

source: བྱས་པ་མེད་པ་ཐམས་ཅད་གཟུགས་ཀྱི་སྣང་བའོ། །དེ་ལྟར་དེ་བཞིན་དུ་འདུ་བྱེད་ཐམས་ཅད་ཀྱི་ལམ་ལས་ཤིན་ཏུ་འདས་ཤིང་མིག་གི་རྣམ་པར་ཤེས་པའི་ལམ་ཀུན་ནས་ལྡང་བ།
en: In that way, they transcend all formations as they continually appear to the eye consciousness.

source: ལྦུ་བའི་ཕུང་པོ་ལྟ་བུའི་གཟུགས་ཀྱི་སྣང་བ་མིག་གི་རྣམ་པར་ཤེས་པས་སྟོང་པ་དེ་ཡང་མིག་འབྱུང་བ་ཆེན་པོ་བཞིའི་རྒྱུའོ། །
en: Like a mass of foam, even those physical appearances are empty of the eye consciousness, as is their basis, the four elements that make up the eye.

source: བདག་མེད་པའི་ཕྱིར་འབྱུང་བ་ཆེན་པོ་བཞི་པོ་དེ་དག་ཀྱང་སྟོང་པ་སྟེ།
en: Because they lack a self, the four great elements are empty as well.

source: ཇི་ལྟར་གོང་དུ་བཤད་པ་བཞིན་དུ་བདག་ཏུ་དམིགས་པའང་མེད་དོ། །
en: As it was explained before, they not apprehended as a self.

source: མིག་གཉིས་ནི་རྒུན་འབྲུམ་ཙམ་སྟེ། མིག་རེ་རེ་ལའང་ཚད་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའོ། །རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ལའང་འབྱུང་བ་ཆེན་པོ་བཞི་པོ་སོགས་སོ། །
en: The eyes are like a bunch of grapes in that each eye is made of countless tiny particles, and those tiny particles are conglomerations of the four great elements.

source: འབྱུང་བ་ཆེན་པོ་བཞི་པོ་རེ་རེ་ལའང་བདག་ཏུ་མི་དམིགས་ཤིང་སེམས་ཅན་དུ་མི་དམིགས་ན། དེ་ལ་རྣམ་པར་ཤེས་པའི་གནས་སམ། ཀུན་ནས་ལྡང་བའང་ལམ་དུ་ཤེས་པར་ལྟ་ཅི་སྨོས།
en: Since those four great elements are not apprehended as a self and not apprehended as existent, what need is there to mention perceiving them as the abode of consciousness or the way that things arise?

source: རྡུལ་ཤིན་དུ་ཕྲ་བ་དེ་དང་དེ་དག་ལ་ཇི་ལྟ་བ་བཞིན་དུ་མིག་འབྱུང་བ་ཆེན་པོ་བསགས་པ་དང་། རྒུན་འབྲུམ་ཙམ་དུ་ཡོངས་སུ་བརྟག་གོ། །
en: Bodhisattvas correctly analyze elements that constitute the eye as conglomerations of various tiny particles like a bunch of grapes.

source: ཡོངས་སུ་བརྟགས་པ་དེས་དེ་ལ་མིག་གི་རྣམ་པར་ཤེས་པའི་གནས་པ་དང་ལམ་ཡང་མེད་དོ། །
en: By that thorough analysis, there is no basis or path of the eye consciousness.

source: དེས་ཡང་དག་པར་ཡོངས་སུ་བརྟགས་པས་སེམས་ཅན་མིག་ཡོངས་སུ་བརྟགས་པར་འགྱུར་རོ། །
en: Bodhisattvas analyze the eyes of beings using that correct analysis.

source: གང་མིག་གི་རྣམ་པར་ཤེས་པ་སྟོང་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པ་དེ་དག་འདོད་ཆགས་དང་བྲལ་བར་འགྲོའོ། །
en: Those who correctly understand that the eye consciousness is empty will be free from attachment.

source: ཇི་ལྟར་ཡང་མིག་གི་རྣམ་པར་ཤེས་པ་སྟོང་པར་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དེ་བཞིན་དུ་ཁམས་གསུམ་གྱི་མིག་མིག་གི་རྣམ་པར་ཤེས་པས་སྟོང་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པར་བྱའོ། །
en: Just as they correctly understand that the eye consciousness is empty, they should correctly understand that the eyes of the three realms are empty of the eye consciousness.

source: ཇི་ལྟར་ཡང་མིག་གིས་གཟུགས་ཀྱི་སྣང་བ་ལྦུ་བའི་ཕུང་པོ་ལྟ་བུ་ནི། ཕྱི་དང་ནང་གི་གཟུགས་ཀྱི་མཚན་ཉིད་སྣང་བ་ནས་ཉེ་བའི་བར་དུ་དེ་དག་ཐམས་ཅད་ལྦུ་བའི་ཕུང་པོ་གཟུགས་ཀྱི་སྣང་བ་འབྱུང་བ་ཆེན་པོ་ནམ་མཁའ་ལ་མི་རྟེན་པར་འགྱུར་རོ། །
en: All of the apparent characteristics of form from those that are external and internal to those that are near are like a mass of foam, in the same way that the physical appearances perceived by the eye are like a mass of foam, and the elements that constitute physical appearances are as baseless as space.

source: ནམ་མཁའ་ཇི་ལྟར་དངོས་པོ་མེད་ཅིང་མཚན་ཉིད་མེད་པ་དང་། མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལྟར་གཟུགས་ཀྱི་མཚན་ཉིད་སྣང་བ་ལྦུ་བའི་ཕུང་པོ་ལྟ་བུ་དེ་དག་ཐམས་ཅད་ཀྱང་སྣང་བའོ། །
en: Physical appearances are empty of characteristics in the same way that space is insubstantial and lacks characteristics, and they all appear like a mass of foam.

source: ཇི་ལྟར་གཟུགས་གཞན་གྱིས་ནམ་མཁའ་སྟོང་པ་ལྟར་ནང་དང་ཕྱིའི་ལུས་ཀྱི་མཚན་ཉིད་ལྦུ་བ་ལྟ་བུར་སྣང་བ་ནས་ཉེ་བའི་བར་དུ་དེ་དག་ཐམས་ཅད་གཟུགས་ཀྱི་མཚན་ཉིད་སྣང་བའང་སྟོང་པའོ། །
en: All of them, from the appearance of internal and external characteristics of the body that are empty of other forms, just like space, up to those that are near, appear as the characteristics of form but are empty.

source: ཇི་ལྟར་མིག་མིག་གི་རྣམ་པར་ཤེས་པས་སྟོང་པ་དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་ཀྱང་ལུས་ཀྱི་རྣམ་པར་ཤེས་པས་སྟོང་ངོ་། །
en: “The ears, nose, tongue, and body are empty of their respective consciousnesses in the same way that the eyes are empty of the eye consciousness.

source: འདོད་པའི་ཁམས་དང་གཟུགས་ཀྱི་ཁམས་ཐམས་ཅད་ཀྱི་མིག་ཀྱང་མིག་དང་མིག་གི་རྣམ་པར་ཤེས་པས་སྟོང་པས་སྟོང་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: Bodhisattvas correctly understand that all eyes of the desire and form realms are empty of the eye and the eye consciousness.

source: དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་ཀྱང་ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: Thus, they correctly understand the others too as empty based on the emptiness of the ears, nose, tongue, body, and their respective consciousnesses.

source: འབྱུང་བ་ཆེན་པོ་ལྟ་བུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་ཅིང་དམིགས་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། གང་ཟག་དང་། ཤེད་ལས་སྐྱེས་པ་དང་། ཤེད་ཅན་དང་། བྱེད་པ་པོ་དང་། བྱེད་དུ་འཇུག་པ་དང་།
en: They do not entertain thoughts or concepts such as the four great elements, and they do not view them as apprehended.

source: ཚོར་བ་པོ་དང་། ཚོར་བར་འཇུག་པ་དང་། སྐྱེ་བ་དང་། ཀུན་ཏུ་སྐྱེ་བ་དང་། ཀུན་ནས་ལྡང་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: They do not see a being, a life force, a soul, a person, a human being, a living creature, a doer, an agent, one who feels, anything that causes feeling, or anything that is born, that is emerging, or that is fully arisen.

source: གཟུགས་ཀྱི་མཚན་ཉིད་སྣང་བའི་མཚན་མས་མཚན་མ་ལས་དམིགས་པའང་མེད་དོ། །སེམས་ཀྱི་གཟུང་བ་དང་། བཏང་བ་དང་།
en: Since the characteristics of form are the marks that appear, there is also no apprehension of marks.

source: མངོན་སུམ་དུ་བྱ་བ་དང་། ཁོང་དུ་ཆུད་པ་དང་། གནས་དང་། ཀུན་ནས་ལྡང་བའི་གནས་དང་། ཡིད་ལ་བྱེད་པའི་གཟུགས་ཀྱི་མཚན་ཉིད་སྣང་བ་དམིགས་པ་མེད་པ་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: Bodhisattvas correctly understand that they are empty through the nonapprehension and the emptiness of mental apprehensions, giving, actualization, comprehension, the basis, the fully arisen basis, and the apparent characteristics of forms on which they focus.

source: གཟུགས་ཀྱི་ཕུང་པོ་དང་། ནམ་མཁའ་དང་། སེམས་ཀྱི་རྣམ་པར་ཤེས་པ་ཐ་དད་པར་རབ་ཏུ་མི་ཤེས་སོ། ཁམས་གསུམ་ཐམས་ཅད་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པར་རབ་ཏུ་ཤེས་སོ། །
en: They do not consider the aggregate of form, space, and mental consciousness to be different, and they understand that they are empty due to the emptiness of everything in the three realms.

source: གང་ཕྱི་རོལ་དང་ནང་གི་ནས་ཉེ་བའི་བར་དུ་གཟུགས་ཀྱི་མཚན་ཉིད་སྣང་བ་ཐམས་ཅད་ལྦུ་བའི་ཕུང་པོ་ལྟ་བུར་སྟོང་པ་ཉིད་དང་། ཟད་པའི་ཚུལ་དང་།
en: They realize that all of the apparent characteristics of forms, from those that are internal and external up to those that are near, are like a mass of foam from the perspective of emptiness and destruction.

source: ཞི་གནས་ལ་འཚེ་བ་མེད་པའི་ཚུལ་དང་། རྟོག་པ་མེད་པའི་ཚུལ་དང་། མི་སྐྱེ་བ་དང་། མི་འགོག་པ་དང་།
en: They realize the lack of distress in tranquility, the absence of concepts, the absence of arising, the absence of cessation, the absence of origination, and the absence of marks.

source: འབྱུང་བ་མེད་པ་དང་། མཚན་མ་མེད་པའི་ཚུལ་གྱིས་རྟོག་གོ། །ནམ་མཁའ་དང་བྲལ་ཞིང་གནས་མེད་པ་དང་། ཚིག་གི་ལམ་ལ་བྲལ་བར་རབ་ཏུ་ཤེས་སོ། །
en: They know that they are free from space, groundless, and free from linguistic expression.

source: ནང་དང་ཕྱི་རོལ་གྱི་འདུ་བྱེད་ནས་ཉེ་བའི་བར་དུ་གཟུགས་ཀྱི་མཚན་ཉིད་ཐམས་ཅད་འཇིག་པའི་ཆོས་དང་། ཟད་པའི་ཆོས་དང་། དངོས་པོའི་རྒྱུན་ཆད་པ་སྟོང་པ་དང་། འཁྲུག་པ་རྒྱུན་ཆད་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: They correctly understand that all the characteristics of formations that are internal and external, up to those that are near, have the quality of disintegrating and perishing, that things are empty and come to an end, and that disturbances come to an end.

source: གང་གཟུགས་ཀྱི་མཚན་ཉིད་ཐམས་ཅད་ཟད་པའི་ཆོས་དེའང་མི་རྟག་པའོ། །
en: All the characteristics of form have the quality of perishing and are impermanent.

source: གང་རྟག་པ་མེད་པ་དེའང་སྡུག་བསྔལ་བའོ། །
en: Whatever is impermanent is suffering.

source: གང་འདུ་བྱེད་ཐམས་ཅད་ཀྱི་ཚིག་གི་མཚན་ཉིད་ཀྱི་ལམ་དང་བྲལ་བ་དེའང་སྟོང་པ་སྟེ།
en: Anything that is a formation is free from all manner of linguistic characteristics and is empty.

source: གང་ཕྱི་དང་ནང་གི་ནས་ཉེ་བའི་བར་དུ་གཟུགས་ཀྱི་མཚན་ཉིད་སྟོང་པ་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དེ་ལྟར་རབ་འབྲིང་དང་ཐ་མའི་ཉོན་མོངས་པ་ཞི་བར་འགྱུར་རོ། །
en: “As they correctly understand, all the empty characteristics of form, from those that are internal and external up to those that are near, their severe, middling, and minor afflictions will be pacified.

source: འདི་ནི་མངོན་པར་འདུ་བྱེད་པའི་མཚན་ཉིད་རྒྱུན་གཅོད་པ་མེད་པའི་བཟོད་པའོ། །
en: This is the acceptance of not bringing an end to the characteristics of formations.

source: ནམ་མཁའ་ཇི་ལྟར་རླུང་མེད་པ་དེ་བཞིན་དུ་བག་ལ་ཉལ་བ་དང་བྲལ་བའི་བཟོད་པའོ། །
en: This acceptance is free from latent tendencies in the same way that space is without wind.

source: ནམ་མཁའ་ཇི་ལྟར་འགྱུར་བ་མེད་པ་དེ་བཞིན་དུ་གཟུགས་ཀྱི་མཚན་ཉིད་སྣང་བ་མེད་པའི་བཟོད་པའོ། །
en: This acceptance lacks the apparent characteristics of form in the same way that space is unchanging.
